resources/parks.xml

<?xml version='1.0' encoding='UTF-8'?><wsdl:definitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://parks.services/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http" name="ParksImplService" targetNamespace="http://parks.services/">
  <wsdl:types>
<xs:schema xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://parks.services/" elementFormDefault="unqualified" targetNamespace="http://parks.services/" version="1.0">

  <xs:element name="byCountry" type="tns:byCountry"/>

  <xs:element name="byCountryResponse" type="tns:byCountryResponse"/>

  <xs:complexType name="byCountry">
    <xs:sequence>
      <xs:element minOccurs="0" name="arg0" type="xs:string"/>
    </xs:sequence>
  </xs:complexType>

  <xs:complexType name="byCountryResponse">
    <xs:sequence>
      <xs:element maxOccurs="unbounded" minOccurs="0" name="return" type="xs:string"/>
    </xs:sequence>
  </xs:complexType>

</xs:schema>
  </wsdl:types>
  <wsdl:message name="byCountry">
    <wsdl:part element="tns:byCountry" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="byCountryResponse">
    <wsdl:part element="tns:byCountryResponse" name="parameters">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="Parks">
    <wsdl:operation name="byCountry">
      <wsdl:input message="tns:byCountry" name="byCountry">
    </wsdl:input>
      <wsdl:output message="tns:byCountryResponse" name="byCountryResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="ParksImplServiceSoapBinding" type="tns:Parks">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="byCountry">
      <soap:operation soapAction="" style="document"/>
      <wsdl:input name="byCountry">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="byCountryResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="ParksImplService">
    <wsdl:port binding="tns:ParksImplServiceSoapBinding" name="ParksImplPort">
      <soap:address location="https://th-apex-soap-service.herokuapp.com/service/parks"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
